{"Blackwing": "Increases CRIT Rate by 8% and increases Normal ATK SPD by 12%. Additionally, Normal and Charged Attacks hits on enemies have a 50% chance to trigger a vaccuum blade that deals 40% of ATK as DMG in a small AoE. This effect can occur no more than once every 2s.", "Sky-Piercing Fang": "Crit Rate increased by 4%. Gains Skypiercing Might upon using Elemental Burst: Increases Movement SPD by 10%, increases ATK SPD by 10%, and increases the DMG of Normal and Charged Attack hits by 20% for 12s.", "Wandering Clouds": "Increases Elemental DMG Bonus by 12%. Normal Attack hits have a 50% chance to earn the favor of the clouds. which actively seek out nearby enemies to attack for 15s, dealing 160% ATK DMG. Can only occur once every 30s.", "Boundless Blessing": "Increases Movement SPD by 10%. When in battle, gain an 8% Elemental DMG Bonus every 4s. Max 4 stacks. Lasts until the character falls or leaves combat.", "Echoing Ballad": "Increases CRIT DMG by 20%. Hits have a 60% chance to inflict a small AoE attack, dealing 125% Physical ATK DMG. Can only occur once every 4s.", "Eagle Spear of Justice": "On hit, increases ATK by 3.2% for 6s. Max 7 stacks. This effect can only occur once every 0.3s. While in possession of the maximum possible stacks, DMG dealt is increased by 12%.", "Rainbow-Piercing Stinger": "Increases Normal Attack SPD by 10%. Increases DMG against enemies affected by any element by 24%.", "Falcon's Defiance": "ATK is increased by 20%. Triggers on taking DMG: the soul of the Falcon of the West awakens, holding the banner of the resistance aloft, regenerating HP equal to 100% of ATK and dealing 200% of ATK as DMG to surrounding enemies. This effect can only occur once every 15s.", "Wolfish Tracker": "Increases Base ATK by 20%. On hit, attacks against enemies with less than 30% HP increase all party members' Base ATK by 40% for 12s. Can only occur once every 30s.", "Sky-ripping Dragon Spine": "Increases all DMG by 8%. After using an Elemental Burst, Normal or Charged Attack, on hit, creates a vacuum blade that does 80% of ATK as DMG to enemies along its path. Lasts for 20s or 8 vacuum blades.", "Strong-Willed": "Increases Normal Attack and Aimed Shot DMG by 12%. Increases DMG from arrows shot by a further 8% for every 0.1s that the arrow is in flight, up to 0.5s.", "Press the Advantage": "After defeating an enemy, ATK is increased by 12% for 30s. This effect has a maximum of 3 stacks, and the duration of each stack is independent of the others.", "Bane of Flame and Water": "Increases DMG against enemies affected by Hydro or Pyro by 12%.", "Magic Affinity": "After using an Elemental Skill, increases Normal and Charged Attack DMG by 8% for 12s. Max 2 stacks.", "Unreturning": "Aimed Shot hits on weak points increase Movement SPD by 10% and ATK by 36% for 10s.", "Infusion Stinger": "Dealing Elemental DMG increases all DMG by 6% for 6s. Max 2 stacks. Can only occur once every 1s.", "Infusion Blade": "On hit, Normal or Charged Attacks increase ATK and DEF by 6% for 6s. Max 4 stacks (24% total). Can only occur once every 0.5s.", "Bane of Fire and Thunder": "Increases DMG against enemies affected by Pyro or Electro by 12%.", "Smashed Stone": "On hit, Normal or Charged Attacks increase ATK and DEF by 4% for 6s. Max 4 stacks. Can only occur once every 0.3s.", "Focus": "Upon damaging an opponent, increases CRIT Rate by 8%. Max 5 stacks. A CRIT hit removes all stacks.", "Composed": "After dealing damage to an enemy with an Elemental Skill, the skill has a 40% chance to end its own CD. Can only occur once every 30s.", "Chord": "Normal or Charged Attacks grant a Harmonic on hits. Gaining 5 Harmonics triggers the power of music and deals 100% ATK DMG to surrounding enemies. Harmonics last up to 30s, and a maximum of 1 can be gained every 0.5s.", "Wavesplitter": "Every 4s a character is on the field, they will deal 6% more DMG and take 3% more DMG. This effect has a maximum of 5 stacks and will not be reset if the character leaves the field, but will be reduced by 1 stack when the character takes DMG.", "Echo": "Normal and Charged Attacks have a 50% chance to fire a Bolt of Perception, dealing 240% ATK as DMG. This bolt can bounce between enemies a maximum of 4 times. This effect can occur once every 12s.", "Lithic Axiom - Unity": "For every character in the party who hails from Liyue, the character who equips this weapon gains 6% ATK increase and 2% CRIT Rate increase.", "Descension": "Hitting enemies with Normal or Charged Attacks grants a 50% chance to deal 200% ATK as DMG in a small AoE. This effect can only occur once every 10s. Additionally, if the Traveler equips the Sword of Descension, their ATK is increased by 66.", "Windfall": "CRIT hits have a 60% chance to generate 1 Elemental Orb, which will regenerate 6 Energy for the character. Can only occur once every 12s.", "Itinerant Hero": "Continuosly sprinting for at least 1s increases ATK by 28% for 6s. This effect cannot stack.", "Urban Guerrilla": "Every 4s a character is on the field, their ATK increases by 4% and their CRIT DMG increases by 4%. This effect has a maximum of 5 stacks and will not be reset if the character leaves the field, but will be cleared when the character takes DMG.", "Lithic Axiom - Subjugating Evil": "Normal Attack hits have a 20% chance of causing the next Charged Attack performed in the following 10s to deal 40% increased DMG.", "Justice": "Increases DMG dealt by Normal and Charged Attacks by 20%.\nAdditionally, regenerates 60% of ATK as HP when Normal and Charged Attacks score a CRIT Hit. This effect can occur once every 5s.", "Wind in the Square": "For every character in the party who hails from Mondstadt, the character who equips this weapon gains 8% ATK increase and 3% Movement SPD increase.", "Gladiator": "If there are at least 2 enemies nearby, ATK is increased by 16% and DEF is increased by 16%. If there are less than 2 enemies nearby, ATK is increased by 24%.", "Verdant Wind": "Upon hit, Normal and Aimed Shot Attacks have a 50% chance to generate a Cyclone, which will continuously attract surrounding enemies, dealing 40% of ATK as DMG to these enemies every 0.5s for 4s. This effect can only occur once every 14s.", "Rebellious Guardian": "Taking DMG generates a shield which absorbs DMG up to 20% of max HP. This shield lasts for 10s or until broken, and can only be triggered once every 45s. While protected by the shield, the character gains 12% increased DMG.", "Infusion Needle": "After picking up an Elemental Orb/Particle, Normal and Charged Attacks deal an additional 20% ATK as DMG for 5s.", "Bane of Storm and Tide": "Increases DMG against enemies affected by Hydro or Electro by 12%.", "Exorcise": "After defeating an enemy, ATK is increased by 12% for 30s. This effect has a maximum of 3 stacks, and the duration of each stack is independent of the others.", "Solar Shine": "Normal Attack hits increase Elemental Skill and Elemental Burst DMG by 20% for 6s. Likewise, Elemental Skill or Elemental Burst hits increase Normal Attack DMG by 20% for 6s.", "Debut": "When a character takes the field, they will gain a random theme song for 10s. This can only occur once every 30s.\nRecitative: ATK is increased by 60%.\nAria: Increases all Elemental DMG by 48%.\nInterlude: Elemental Mastery is increased by 240.", "Gilding": "Using an Elemental Burst regenerates 4 Energy every 2s for 6s. Additionally, all party members will regenerate 4% HP every 2s for this duration.", "Infusion Scroll": "Triggering an Elemental reaction grants a 8% Elemental DMG Bonus for 10s. Max 2 stacks.", "Critical Charge": "CRIT hits have a 60% chance to generate a small amount of Elemental Particles, which will regenerate 6 Energy for the character. Can only occur once every 12s.", "Crush": "On hit, Normal or Charged Attacks have a 50% chance to deal an additional 240% ATK DMG to enemies within a small AoE. Can only occur once every 15s.", "Infusion Arrow": "Normal Attack and Aimed Shot hits increase ATK by 4% and Normal ATK SPD by 1.2% for 6s. Max 4 stacks. Can only occur once every 0.3s.", "Arrowless Song": "Increases Elemental Skill and Elemental Burst DMG by 24%.", "Rapid Firing": "Increases Normal Attack DMG by 40% but decreases Aimed Shot DMG by 10%", "Guerilla Tactic": "Defeating an enemy increases Movement SPD and ATK by 12% for 15s.", "Cull the Weak": "Defeating an opponent restores 8% HP.", "Decimate": "Increases DMG against mechanoid Ruin enemies by 40%.", "Gash": "On hit, has 50% chance to deal 240% ATK DMG to a single enemy. Can only occur once every 15s.", "Heavy": "Normal Attacks deal an additional 160% DMG. Can only occur once every 10s.", "Energy Shower": "Each Elemental Orb or Particle collected restores 1% HP.", "Archer's Message": "Aimed Shot hits on weak spots deal an additional 100% ATK DMG as CRIT DMG. Can only occur once every 10s.", "Slingshot": "If a Normal Attack or Aimed Shot hits a target within 0.3s of being fired, increases DMG by 36%. Otherwise, it decreases DMG by 10%.", "Precise": "Increases DMG against weak spots by 24%.", "Journey": "Each Elemental Orb or Particle collected restores 1% HP.", "Sharp": "Increases Normal Attack DMG by 24%.", "Determination": "Using an Elemental Burst grants a 12% increase in ATK and Movement SPD for 15s.", "Elemental Mastery": "Normal Attack hits increase all Elemental DMG by 6% for 6s. Max 2 stacks.", "Rapids": "Upon causing a Vaporize, Electro-Charged, Frozen, or a Hydro-infused Swirl reaction, increases ATK by 20% for 12s.", "Legacy": "When switching characters, the new character taking the field has their ATK increased by 24% for 10s. This effect can only occur once every 20s.", "Vigorous": "When HP is above 90%, increases CRIT Rate by 14%.", "Overloaded": "Upon causing an Overloaded, Superconduct, Electro-Charged, or an Electro-infused Swirl reaction, increases Base ATK by 20% for 12s.", "Bane of Water and Ice": "Increases DMG against enemies affected by Hydro or Cryo by 12%.", "Courage": "On hit, Normal or Charged Attacks increase ATK by 6% for 6s. Max 4 stacks. Can only occur once every 0.5s.", "Residual Heat": "Upon causing an Overloaded, Melt, Burning, Vaporize, or a Pyro-infused Swirl reaction, increases Base ATK by 20% for 12s.", "Unbending": "When HP falls below 70%, increases Charged Attack DMG by 30%, and Charged Attacks become much harder to interrupt.", "Bane of the Soft": "Increases DMG against slimes by 40%.", "Blunt Conclusion": "After using an Elemental Skill, Normal or Charged Attacks, on hit, deal an additional 60% ATK DMG in a small area. Effect lasts 15s. DMG can only occur once every 3s.", "None": "None"}